/* 
spread operator ব্যবহার করে কি কি করা যায়?
১. কোন এ্যারে বা অবজেক্ট এর ভিতর থেকে সকল উপাদানকে বের করতে পারি।
২. কোন এ্যারে বা অবজক্টেকে কপি করতে পারি।
৩. কোন এ্যারে বা অবজেক্ট এর মধ্যে নতুন উপাদান যোগ করতে পারি।
এসব কাজের দ্বারা অরিজিনাল এ্যারে বা অবজেক্টের মধ্যে কোন পরিবর্তন আনবে না।

====================
-> যদি কোন নতুন ভ্যারিয়েবলে পুর্বে ডিক্লেয়ার করা কোন ভ্যারিয়েবলের মান রাখা হয়, তাহলে উভয়টি সবসময় নতুন মান রিটার্ন করে। 
-> যদি কোন একটিতে পরিবর্তন করা হয়, তাহলে উভয়টিতে পরিবর্তন আসবে। কারণ, এ্যারে বা অবজেক্ট হলো pass by reference পাস বাই রেফারেন্স বা (call by reference) কল বাই রেফারেন্স । 
-> তাই পূর্বের ভ্যারিয়েবল অক্ষত রেখে নতুন ভ্যারিয়েবল তৈরির জন্য spread operator হলো উত্তম।
*/

const numbers = [9, 2, 3, 10, 34, 54, 3]
const numbers2 = numbers;
const numbers3 = [...numbers]
numbers.push(200)
numbers2.push(300)
console.log(numbers);
console.log(numbers2);
console.log(numbers3);