/* 
১. কখন const আর কখন let দিয়ে ভেরিয়েবল ডিক্লেয়ার করতে হয় সেটা তোমাকে জানতেই হবে। তুমি নিজে নিজে একটা const দিয়ে আরেকটা let দিয়ে ভেরিয়েবল ডিক্লেয়ার করে ফেলো।

-> যদি কোন ভ্যারিয়েবলের মান পরিবর্তন করা লাগবে না। সব সময় একই ভ্যালু থাকবে, তখন const ব্যবহার করব।
আর ভ্যারিয়েবলের মান পরিবর্তন করা লাগবে এমন হলে let ব্যবহার করতে হবে।
*/


/* 
২. টেম্পলেট স্ট্রিং দিয়ে একটা স্ট্রিং তৈরি করো। সেটার মধ্যে উপরে ডিক্লেয়ার করা ভেরিয়েবল এর মান ডাইনামিক ভাবে বসাও। একইভাবে উপরে একটা অবজেক্ট ডিক্লেয়ার করো। এবং ডাইনামিকভাবে উপরের অবজেক্ট এর দুইটা প্রপার্টি এর মান তোমার টেমপ্লেট স্ট্রিং এর মধ্যে বসাও। 
 */
{
    const firstName = 'Numan'
    const lastName = 'Ahmed'
    const fullName = `My name is ${firstName} ${lastName}`
    console.log(fullName);
}

/* 
৩.১ একটা প্যারামিটার ওয়ালা arrow ফাংশন ডিক্লেয়ার করো। এবং সেই ফাংশনের কাজ হবে তুমি কোন ইনপুট দিলে সেই ইনপুট সংখ্যাকে ৫ দিয়ে ভাগ করে আউটপুট দিবে। 
 */
{
    const dividedByFive = (number) => number / 5;
    console.log(dividedByFive(50));
}

/* 
৩.২ তুমি দুইটা প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন লিখবে। সেই ফাংশনের ভিতরে কাজ হবে। প্রত্যেকটা ইনপুট প্যারামিটার এর সাথে ২ যোগ করবে তারপর যোগফল দুইটা গুণ করবে। ক্যামনে করবে সেটা চিন্তা করে বের করার চেষ্টা করো 
 */
{
    const twoParams = (a, b) => (a + 2) * (b + 2)
    console.log(twoParams(3, 3));
    const twoParam = (a, b) => {
        const addTwo = a + 2
        const addT = b + 2
        const times = addT * addTwo
        return times
    }
    console.log(twoParam(3, 3));
}

/* 
৩.৩ এইবার তিনটা প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন ডিক্লেয়ার করো। যেই ফাংশনের কাজ হবে তিনটা প্যারামিটার নিয়ে সেই তিনটা প্যারামিটারকে গুণ করে সেই রেজাল্ট রিটার্ন করবে। 
*/

{
    const times3Params = (a, b, c) => {
        return a * b * c
    }
    console.log(times3Params(2,3,4));
}

/* 
৩.৪ এইবার দুইটা প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন নিবে। ওই arrow ফাংশনটা হবে অনেকগুলা লাইনের। সেখানে প্রত্যেকটা ইনপুট প্যারামিটার এর সাথে ২ যোগ করবে তারপর যোগফল দুইটা গুণ করবে। ক্যামনে করবে সেটা চিন্তা করে বের করার চেষ্টা করো। 
*/
{
    const twoParams = (a, b) => (a + 2) * (b + 2)
    console.log(twoParams(3, 3));
    const twoParam = (a, b) => {
        const addTwo = a + 2
        const addT = b + 2
        const times = addT * addTwo
        return times
    }
    console.log(twoParam(3, 3));
}


